<?php

    class BaseObject
    {
        var $m_properties = array();
        var $m_error;
        var $m_errors;
        var $m_validator;
        var $m_pcollection;

        /********************************************************************
        *
        ********************************************************************/

        function BaseObject()
        {
            $this->m_error = false;
            $this->m_errors = array();
            $this->m_validator = false;
        }

        /********************************************************************
        *
        *   Устанавливает сообщение об ошибке в виде строки
        *
        ********************************************************************/

        function setSingleErrorMsg($error)
        {
            $this->m_error = $error;
        }

        /********************************************************************
        *
        *   Возвращает сообщение об ошибке в виде строки
        *
        ********************************************************************/

        function getSingleErrorMsg()
        {
            return $this->m_error;
        }

        /********************************************************************
        *
        *   Добавляет сообщение об ошибке в хеш сообщений об ошибке
        *
        ********************************************************************/

        function addError($error)
        {
            $this->m_errors[]["error"] = $error;
        }

        /********************************************************************
        *
        *   Возвращает хеш сообщений об ошибке
        *
        ********************************************************************/

        function getErrors()
        {
            return $this->m_errors;
        }

        /********************************************************************
        *
        *   Очищает хеш сообщений об ошибке
        *
        ********************************************************************/

        function clearErrors()
        {
            $this->m_errors = array();
        }

        /********************************************************************
        *
        *   Устанавливает объект Validator для класса
        *
        ********************************************************************/

        function setValidator(&$Validator)
        {
            $this->m_validator =&$Validator;
            return $this->checkValidator();
        }

        /********************************************************************
        *
        *   Проверяет, соответствует ли объект классу Validator
        *
        ********************************************************************/

        function checkValidator()
        {
            if( get_class($this->m_validator) == strtolower(VALIDATOR_CLASS_NAME) )
                return true;

            return false;
        }

        /********************************************************************
        *
        ********************************************************************/

    }
?>
